// 한줄주석 : //가 시작되는 지점부터 한줄을 모두 주석으로 바꿔서 처리
/* 구간주석 : 주석문자들이 있는 사이에 모든 것을 주석으로 바꿔서 처리 */
// 용도 : 사람에게 전달할 간단한 설명/용도 등을 작성하기 위한 것

#include <stdio.h>
// 전처리문 include : 오른쪽에 있는 대상 파일의 내용을 불러오는 명령어
// 헤더파일 stdio.h : 프로그램을 만드는데 필요한 추가기능이 담겨있음
// STanDard Input and Out 의 약자로 stdio이다.
// +@ 헤더파일은 필요한 게 있으면 더 불러올 수 있다.

// 메인함수 : C언어의 모든 것이 시작되는 공간
// - 프로그램에 필요한 공간을 확보하는 과정
// - 그 공간의 이름을 main이라고 이름붙여 구별
int main(void) {
	// 중괄호 내부 : 우리가 만들고자는 절차를 작성하는 공간
	
	return 0; // 프로그램을 정상종료시키는 명령어
}
// 소스파일의 실행 : ctrl를 누른 상태 + F5
